In [12]:
import pandas as pd 
import geopandas as gpd 

df = pd.read_csv('market_aff.csv')
gdf = gpd.read_file('NUTS_RG_03M_2013_4326_LEVL_2.geojson')

In [412]:
gdf = gpd.read_file('def.geojson')
gdf.head()

,id,LEVL_CODE,NUTS_ID,CNTR_CODE,NUTS_NAME,NAME_LATN,FID,VALUE,geometry
0,AT111,3,AT111,AT,Mittelburgenland,Mittelburgenland,AT111,160.0,"POLYGON ((16.64622 47.44660, 16.62192 47.43321..."
1,AT112,3,AT112,AT,Nordburgenland,Nordburgenland,AT112,751.0,"POLYGON ((17.16080 48.00666, 17.09467 47.97086..."
2,AT113,3,AT113,AT,Südburgenland,Südburgenland,AT113,432.0,"POLYGON ((16.43371 47.35282, 16.46453 47.33385..."
3,AT121,3,AT121,AT,Mostviertel-Eisenwurzen,Mostviertel-Eisenwurzen,AT121,729.0,"POLYGON ((15.53180 48.30819, 15.52720 48.29801..."
4,AT122,3,AT122,AT,Niederösterreich-Süd,Niederösterreich-Süd,AT122,985.0,"POLYGON ((15.91586 48.08854, 15.93284 48.07016..."

In [167]:
dth = pd.read_excel('death_rate_t.xlsx')
dth.dropna(inplace=True)
dth.reset_index(inplace=True, drop=True)

In [168]:
dth.head()

    NUTS  VALUE
0  BG311  319.0
1  BG312  403.0
2  BG313  523.0
3  BG314  869.0
4  BG315  451.0

In [333]:
dz = pd.read_clipboard()
dz

,TIME,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,BG311,440.0,314.0,NaN,504.000,428.00,336.0,312.0,319.0,361.000,272.000,NaN
1,BG312,587.0,361.0,NaN,564.000,462.00,379.0,430.0,403.0,456.000,396.000,NaN
2,BG313,824.0,529.0,NaN,640.000,714.00,557.0,560.0,523.0,546.000,511.000,NaN
3,BG314,994.0,855.0,NaN,1.119,1.01,851.0,815.0,869.0,1.002,791.000,NaN
4,BG315,536.0,392.0,NaN,582.000,574.00,502.0,498.0,451.0,524.000,426.000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
847,SE313,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.152,NaN
848,SE321,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.095,NaN
849,SE322,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,589.000,NaN
850,SE331,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.263,NaN
851,SE332,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,930.000,NaN

In [374]:
dz = pd.DataFrame(dz)

for i, col in dz.iterrows():
    m = dz.mean(axis=1)
    dz['2015'] = dz['2015'].fillna(dz['2015'].mean())
dz['2015'].isna().value_counts()

False    852
Name: 2015, dtype: int64

In [368]:
m

0      365.111111
1      448.666667
2      600.444444
3      575.347889
4      498.333333
          ...
847      1.152000
848      1.095000
849    589.000000
850      1.263000
851    930.000000
Length: 852, dtype: float64

In [401]:
# dzs = dz[['TIME', '2015']]
# dzs = pd.DataFrame(dzs)
dzs.columns= ['NUTS_ID', '2015']
dzs

    NUTS_ID     2015
0     BG311  319.000
1     BG312  403.000
2     BG313  523.000
3     BG314  869.000
4     BG315  451.000
..      ...      ...
847   SE313    1.152
848   SE321    1.095
849   SE322  589.000
850   SE331    1.263
851   SE332  930.000

[852 rows x 2 columns]

In [387]:
pdf = gpd.read_file('NUTS_RG_03M_2010_4326_LEVL_3.geojson')
pdf1 = gpd.read_file('NUTS_RG_03M_2013_4326_LEVL_3.geojson')
n1 = pd.concat([pdf, pdf1])
n1 = gpd.GeoDataFrame(n1)
n1.shape

(2933, 8)

In [406]:
# dzs.reset_index(drop=True,inplace=True)
# nuts_all.reset_index(drop=True,inplace=True)
dzsz = pd.merge(nuts_all, dzs, how='right', on='NUTS_ID')
dzsz.head()

,id,LEVL_CODE,NUTS_ID,CNTR_CODE,NUTS_NAME,NAME_LATN,FID,geometry,2015
0,BG311,3.0,BG311,BG,Видин,Vidin,BG311,"POLYGON ((22.96638 44.09822, 22.96646 44.09820...",319.0
1,BG311,3.0,BG311,BG,Видин,Vidin,BG311,"POLYGON ((22.99715 43.80763, 23.00233 43.79331...",319.0
2,BG312,3.0,BG312,BG,Монтана,Montana,BG312,"POLYGON ((23.63000 43.79095, 23.63182 43.73229...",403.0
3,BG312,3.0,BG312,BG,Монтана,Montana,BG312,"POLYGON ((23.63008 43.79126, 23.62552 43.78021...",403.0
4,BG313,3.0,BG313,BG,Враца,Vratsa,BG313,"POLYGON ((24.11226 43.69874, 24.11229 43.69873...",523.0

In [407]:
# dzsz['2015'].isna().value_counts()

(1461, 9)

In [408]:
dzsz['2015'].isna().value_counts()

False    1461
Name: 2015, dtype: int64

In [397]:
d0 = gpd.GeoDataFrame(dzsz, geometry=dzsz['geometry'])

In [409]:
dzsz.to_file('egr.geojson', driver='GeoJSON')

In [148]:
# ptnt_tot = nuts2010.merge(ptnt, left_on='NUTS_ID', right_on='NUTSCODE')
ptnt_tot.to_file('patents_submit.geojson', driver='GeoJSON')

In [178]:
difs = dth['NUTS'].isin(nuts2013['NUTS_ID'])
pd.set_option('display.max_rows', difs.shape[0]+1)
difs.value_counts()

True     591
False    156
Name: NUTS, dtype: int64

In [14]:
df = df[['tunit_code', 'TOTAL']]
df = pd.DataFrame(df)
df.head()

  tunit_code   TOTAL
0       IE02   366.0
1       EL53  1008.0
2       EL65   210.0
3       ES11   117.0
4       ES12   589.0

In [15]:
gdf.head()

,id,NUTS_ID,LEVL_CODE,CNTR_CODE,NAME_LATN,NUTS_NAME,FID,geometry
0,FR24,FR24,2,FR,Centre,Centre,FR24,"POLYGON ((1.50153 48.94105, 1.51200 48.93447, ..."
1,FR62,FR62,2,FR,Midi-Pyrénées,Midi-Pyrénées,FR62,"MULTIPOLYGON (((2.06291 44.97650, 2.08070 44.9..."
2,FRA5,FRA5,2,FR,Mayotte,Mayotte,FRA5,"MULTIPOLYGON (((45.29479 -12.79293, 45.27869 -..."
3,ITF3,ITF3,2,IT,Campania,Campania,ITF3,"MULTIPOLYGON (((14.38252 41.44322, 14.40097 41..."
4,ITF4,ITF4,2,IT,Puglia,Puglia,ITF4,"POLYGON ((16.02474 41.42559, 16.09344 41.40064..."

In [16]:
df_tot = gdf.merge(df, left_on='FID', right_on='tunit_code')
df_tot

,id,NUTS_ID,LEVL_CODE,CNTR_CODE,NAME_LATN,NUTS_NAME,FID,geometry,tunit_code,TOTAL
0,ITF4,ITF4,2,IT,Puglia,Puglia,ITF4,"POLYGON ((16.02474 41.42559, 16.09344 41.40064...",ITF4,94.0
1,ITH3,ITH3,2,IT,Veneto,Veneto,ITH3,"MULTIPOLYGON (((12.69064 46.65697, 12.71644 46...",ITH3,237.0
2,ITH4,ITH4,2,IT,Friuli-Venezia Giulia,Friuli-Venezia Giulia,ITH4,"MULTIPOLYGON (((13.50425 46.56630, 13.51989 46...",ITH4,99.0
3,ITG2,ITG2,2,IT,Sardegna,Sardegna,ITG2,"MULTIPOLYGON (((9.74887 40.66041, 9.74668 40.6...",ITG2,165.0
4,NL33,NL33,2,NL,Zuid-Holland,Zuid-Holland,NL33,"POLYGON ((4.61168 52.31359, 4.58842 52.28046, ...",NL33,455.0
...,...,...,...,...,...,...,...,...,...,...
98,PL21,PL21,2,PL,Malopolskie,Malopolskie,PL21,"POLYGON ((20.68154 50.20587, 20.68193 50.21654...",PL21,1214.0
99,PL22,PL22,2,PL,Slaskie,Slaskie,PL22,"POLYGON ((19.24314 51.03684, 19.25057 51.04001...",PL22,1746.0
100,PT16,PT16,2,PT,Centro (PT),Centro (PT),PT16,"MULTIPOLYGON (((-6.92990 41.02947, -6.93137 41...",PT16,628.0
101,SE11,SE11,2,SE,Stockholm,Stockholm,SE11,"MULTIPOLYGON (((19.18842 59.78706, 19.20013 59...",SE11,114.0
102,UKM2,UKM2,2,UK,Eastern Scotland,Eastern Scotland,UKM2,"POLYGON ((-2.42535 56.75519, -2.44232 56.72524...",UKM2,1800.0

In [17]:
df_tot.to_file('total_jobs_affected.geojson', driver='GeoJSON')

'borders'

In [27]:
df_this = gpd.read_file('total_jobs_affected.geojson')
df_this = df_this.rename(columns={'geometry': 'borders'}).set_geometry('borders')
df_this.geometry.name
df_this['centroid_column'] = df_this.centroid
df_this = df_this.set_geometry('centroid_column')
df_this

<ipython-input-27-d53f4c42d02a>:4: UserWarning: Geometry is in a geographic CRS. Results from 'centroid' are likely incorrect. Use 'GeoSeries.to_crs()' to re-project geometries to a projected CRS before this operation.

  df_this['centroid_column'] = df_this.centroid

,id,NUTS_ID,LEVL_CODE,CNTR_CODE,NAME_LATN,NUTS_NAME,FID,tunit_code,TOTAL,borders,centroid_column
0,ITF4,ITF4,2,IT,Puglia,Puglia,ITF4,ITF4,94.0,"POLYGON ((16.02474 41.42559, 16.09344 41.40064...",POINT (16.61919 40.98456)
1,ITH3,ITH3,2,IT,Veneto,Veneto,ITH3,ITH3,237.0,"MULTIPOLYGON (((12.69064 46.65697, 12.71644 46...",POINT (11.84081 45.66462)
2,ITH4,ITH4,2,IT,Friuli-Venezia Giulia,Friuli-Venezia Giulia,ITH4,ITH4,99.0,"MULTIPOLYGON (((13.50425 46.56630, 13.51989 46...",POINT (13.05186 46.15991)
3,ITG2,ITG2,2,IT,Sardegna,Sardegna,ITG2,ITG2,165.0,"MULTIPOLYGON (((9.74887 40.66041, 9.74668 40.6...",POINT (9.03019 40.08696)
4,NL33,NL33,2,NL,Zuid-Holland,Zuid-Holland,NL33,NL33,455.0,"POLYGON ((4.61168 52.31359, 4.58842 52.28046, ...",POINT (4.48459 51.93805)
...,...,...,...,...,...,...,...,...,...,...,...
98,PL21,PL21,2,PL,Malopolskie,Malopolskie,PL21,PL21,1214.0,"POLYGON ((20.68154 50.20587, 20.68193 50.21654...",POINT (20.26892 49.85894)
99,PL22,PL22,2,PL,Slaskie,Slaskie,PL22,PL22,1746.0,"POLYGON ((19.24314 51.03684, 19.25057 51.04001...",POINT (18.99389 50.33107)
100,PT16,PT16,2,PT,Centro (PT),Centro (PT),PT16,PT16,628.0,"MULTIPOLYGON (((-6.92990 41.02947, -6.93137 41...",POINT (-7.99322 40.13402)
101,SE11,SE11,2,SE,Stockholm,Stockholm,SE11,SE11,114.0,"MULTIPOLYGON (((19.18842 59.78706, 19.20013 59...",POINT (18.14831 59.47268)
102,UKM2,UKM2,2,UK,Eastern Scotland,Eastern Scotland,UKM2,UKM2,1800.0,"POLYGON ((-2.42535 56.75519, -2.44232 56.72524...",POINT (-3.38736 56.19020)

In [28]:
df_this = df_this.rename(columns={'centroid_column' :'geometry'})
df_this.drop(['borders'], axis=1, inplace=True)
df_this.head()

,id,NUTS_ID,LEVL_CODE,CNTR_CODE,NAME_LATN,NUTS_NAME,FID,tunit_code,TOTAL,geometry
0,ITF4,ITF4,2,IT,Puglia,Puglia,ITF4,ITF4,94.0,POINT (16.61919 40.98456)
1,ITH3,ITH3,2,IT,Veneto,Veneto,ITH3,ITH3,237.0,POINT (11.84081 45.66462)
2,ITH4,ITH4,2,IT,Friuli-Venezia Giulia,Friuli-Venezia Giulia,ITH4,ITH4,99.0,POINT (13.05186 46.15991)
3,ITG2,ITG2,2,IT,Sardegna,Sardegna,ITG2,ITG2,165.0,POINT (9.03019 40.08696)
4,NL33,NL33,2,NL,Zuid-Holland,Zuid-Holland,NL33,NL33,455.0,POINT (4.48459 51.93805)

In [30]:
df_this = gpd.GeoDataFrame(df_this)
df_this.to_file('jobs_affected.geojson', driver='GeoJSON')

In [33]:
df_this.shape

(103, 10)

In [31]:
df_job = pd.read_csv('tot_job.csv')
df_job

,Unnamed: 0,NUTS-2,NUTS-2 name,Type of coal,Jobs,Unnamed: 4,Risk rate,Risk zone
0,0,RO42,Vest,Hard coal,NaN,4 442,20.0,High
1,1,SK02,Západné Slovensko,Lignite,NaN,2 190,20.0,High
2,2,ES12,Principado de Asturias,Hard coal,NaN,1 313,18.5,High
3,3,CZ08,Moravskoslezsko,Hard coal,NaN,10 131,18.0,High
4,4,DEA3,Münster,Hard coal,NaN,9 640,18.0,High
5,5,ITG2,Sardegna,Hard coal,NaN,348,17.0,High
6,6,PL22,Śląskie,Hard coal,NaN,79 548,17.0,High
7,7,SI03,Vzhodna Slovenija,Lignite,NaN,1 274,17.0,High
8,8,UKE3,South Yorkshire,Hard coal,NaN,34,17.0,High
9,9,ES41,Castilla y León,Hard coal,NaN,394,16.5,Medium
10,10,BG41,Yugozapaden,Brown coal,NaN,991,16.0,Medium
11,11,PL21,Małopolskie,Hard coal,NaN,4 644,16.0,Medium
12,12,RO41,Sud-Vest Oltenia,Lignite,NaN,10 600,16.0,Medium
13,13,ES42,Castilla-La Mancha,Hard coal,NaN,219,16.0,Medium
14,14,UKE2,North Yorkshire,Hard coal,NaN,333,16.0,Medium
15,15,UKF1,Derbyshire and,Hard coal,NaN,80,16.0,Medium
16,16,NaN,Nottinghamshire,NaN,NaN,NaN,NaN,NaN
17,17,CZ04,Severozápad,Lignite,NaN,7 869,15.5,Medium
18,18,DE40,Brandenburg,Lignite,NaN,3 402,15.0,Medium
19,19,PL31,Lubelskie,Hard coal,NaN,5 769,15.0,Medium
20,20,BG34,Yugoiztochen,Lignite,NaN,10 773,14.0,Medium
21,21,DED2,Dresden,Lignite,NaN,2 783,14.0,Medium
22,22,DEE0,Sachsen-Anhalt,Lignite,NaN,904,14.0,Medium
23,23,DED5,Leipzig,Lignite,NaN,1 004,14.0,Medium
24,24,PL41,Wielkopolskie,Lignite,NaN,2 079,14.0,Medium
25,25,ES24,Aragón,Hard coal,NaN,1 422,14.0,Medium
26,26,PL11,Łódzkie,Lignite,NaN,6 388,13.5,Low
27,27,DEA2,Köln,Lignite,NaN,4 420,13.0,Low
28,28,EL53,Dytiki Makedonia,Lignite,NaN,4 283,13.0,Low
29,29,EL65,Peloponnisos,Lignite,NaN,636,13.0,Low
30,30,UKL1,West Wales and The,Hard coal,NaN,367,13.0,Low
31,31,NaN,Valleys,NaN,NaN,NaN,NaN,NaN
32,32,UKC2,Northumberland and,Hard coal,NaN,723,12.5,Low
33,33,NaN,Tyne and Wear,NaN,NaN,NaN,NaN,NaN
34,34,HU31,Észak-Magyarország,Lignite,NaN,1 655,12.0,Low
35,35,PL51,Dolnośląskie,Lignite,NaN,1 108,12.0,Low
36,36,UKM3,South Western Scotland,Hard coal,NaN,241,12.0,Low
37,37,UKL2,East Wales,Hard coal,NaN,184,12.0,Low
38,38,DEA1,Düsseldorf,Lignite,NaN,2 578,11.0,Low

In [32]:
df_job.drop(['jobs'], axis=1, inplace=True)

(39, 8)

In [34]:
df_job_all = df_this.merge(df_job, left_on='FID', right_on='NUTS-2')
df_job_all

,id,NUTS_ID,LEVL_CODE,CNTR_CODE,NAME_LATN,NUTS_NAME,FID,tunit_code,TOTAL,geometry,Unnamed: 0,NUTS-2,NUTS-2 name,Type of coal,Jobs,Unnamed: 4,Risk rate,Risk zone
0,ITG2,ITG2,2,IT,Sardegna,Sardegna,ITG2,ITG2,165.0,POINT (9.03019 40.08696),5,ITG2,Sardegna,Hard coal,NaN,348,17.0,High
1,HU31,HU31,2,HU,Észak-Magyarország,Észak-Magyarország,HU31,HU31,632.0,POINT (20.48766 48.04732),34,HU31,Észak-Magyarország,Lignite,NaN,1 655,12.0,Low
2,ES24,ES24,2,ES,Aragón,Aragón,ES24,ES24,350.0,POINT (-0.65984 41.51941),25,ES24,Aragón,Hard coal,NaN,1 422,14.0,Medium
3,ES41,ES41,2,ES,Castilla y León,Castilla y León,ES41,ES41,861.0,POINT (-4.78205 41.75422),9,ES41,Castilla y León,Hard coal,NaN,394,16.5,Medium
4,ES42,ES42,2,ES,Castilla-La Mancha,Castilla-La Mancha,ES42,ES42,0.0,POINT (-3.00459 39.58096),13,ES42,Castilla-La Mancha,Hard coal,NaN,219,16.0,Medium
5,EL65,EL65,2,EL,Peloponnisos,Πελοπόννησος,EL65,EL65,210.0,POINT (22.45833 37.34267),29,EL65,Peloponnisos,Lignite,NaN,636,13.0,Low
6,EL53,EL53,2,EL,Dytiki Makedonia,Δυτική Μακεδονία,EL53,EL53,1008.0,POINT (21.48411 40.36184),28,EL53,Dytiki Makedonia,Lignite,NaN,4 283,13.0,Low
7,ES12,ES12,2,ES,Principado de Asturias,Principado de Asturias,ES12,ES12,589.0,POINT (-5.99285 43.29214),2,ES12,Principado de Asturias,Hard coal,NaN,1 313,18.5,High
8,BG34,BG34,2,BG,Yugoiztochen,Югоизточен,BG34,BG34,0.0,POINT (26.54087 42.47193),20,BG34,Yugoiztochen,Lignite,NaN,10 773,14.0,Medium
9,BG41,BG41,2,BG,Yugozapaden,Югозападен,BG41,BG41,0.0,POINT (23.34295 42.31795),10,BG41,Yugozapaden,Brown coal,NaN,991,16.0,Medium
10,DEA1,DEA1,2,DE,Düsseldorf,Düsseldorf,DEA1,DEA1,1856.0,POINT (6.59619 51.43016),38,DEA1,Düsseldorf,Lignite,NaN,2 578,11.0,Low
11,DEA2,DEA2,2,DE,Köln,Köln,DEA2,DEA2,3070.0,POINT (6.80943 50.82505),27,DEA2,Köln,Lignite,NaN,4 420,13.0,Low
12,DEA3,DEA3,2,DE,Münster,Münster,DEA3,DEA3,370.0,POINT (7.41647 51.95066),4,DEA3,Münster,Hard coal,NaN,9 640,18.0,High
13,CZ04,CZ04,2,CZ,Severozápad,Severozápad,CZ04,CZ04,192.0,POINT (13.42929 50.39452),17,CZ04,Severozápad,Lignite,NaN,7 869,15.5,Medium
14,DED2,DED2,2,DE,Dresden,Dresden,DED2,DED2,0.0,POINT (14.14001 51.17059),21,DED2,Dresden,Lignite,NaN,2 783,14.0,Medium
15,CZ08,CZ08,2,CZ,Moravskoslezsko,Moravskoslezsko,CZ08,CZ08,0.0,POINT (17.97938 49.82047),3,CZ08,Moravskoslezsko,Hard coal,NaN,10 131,18.0,High
16,DE40,DE40,2,DE,Brandenburg,Brandenburg,DE40,DE40,3000.0,POINT (13.39767 52.47265),18,DE40,Brandenburg,Lignite,NaN,3 402,15.0,Medium
17,DED5,DED5,2,DE,Leipzig,Leipzig,DED5,DED5,0.0,POINT (12.67442 51.35890),23,DED5,Leipzig,Lignite,NaN,1 004,14.0,Medium
18,DEE0,DEE0,2,DE,Sachsen-Anhalt,Sachsen-Anhalt,DEE0,DEE0,960.0,POINT (11.70056 52.01362),22,DEE0,Sachsen-Anhalt,Lignite,NaN,904,14.0,Medium
19,SI03,SI03,2,SI,Vzhodna Slovenija,Vzhodna Slovenija,SI03,SI03,820.0,POINT (15.26028 46.15226),7,SI03,Vzhodna Slovenija,Lignite,NaN,1 274,17.0,High
20,SK02,SK02,2,SK,Západné Slovensko,Západné Slovensko,SK02,SK02,133.0,POINT (18.06682 48.41736),1,SK02,Západné Slovensko,Lignite,NaN,2 190,20.0,High
21,UKC2,UKC2,2,UK,Northumberland and Tyne and Wear,Northumberland and Tyne and Wear,UKC2,UKC2,420.0,POINT (-2.01899 55.21171),32,UKC2,Northumberland and,Hard coal,NaN,723,12.5,Low
22,UKE2,UKE2,2,UK,North Yorkshire,North Yorkshire,UKE2,UKE2,1500.0,POINT (-1.40790 54.18276),14,UKE2,North Yorkshire,Hard coal,NaN,333,16.0,Medium
23,UKF1,UKF1,2,UK,Derbyshire and Nottinghamshire,Derbyshire and Nottinghamshire,UKF1,UKF1,4943.0,POINT (-1.34080 53.13194),15,UKF1,Derbyshire and,Hard coal,NaN,80,16.0,Medium
24,UKL2,UKL2,2,UK,East Wales,East Wales,UKL2,UKL2,500.0,POINT (-3.29446 52.29015),37,UKL2,East Wales,Hard coal,NaN,184,12.0,Low
25,PL41,PL41,2,PL,Wielkopolskie,Wielkopolskie,PL41,PL41,1461.0,POINT (17.24260 52.33068),24,PL41,Wielkopolskie,Lignite,NaN,2 079,14.0,Medium
26,PL51,PL51,2,PL,Dolnoslaskie,Dolnoslaskie,PL51,PL51,1399.0,POINT (16.41050 51.08957),35,PL51,Dolnośląskie,Lignite,NaN,1 108,12.0,Low
27,PL11,PL11,2,PL,Lódzkie,Lódzkie,PL11,PL11,198.0,POINT (19.41754 51.60481),26,PL11,Łódzkie,Lignite,NaN,6 388,13.5,Low
28,RO41,RO41,2,RO,Sud-Vest Oltenia,Sud-Vest Oltenia,RO41,RO41,450.0,POINT (23.66963 44.59695),12,RO41,Sud-Vest Oltenia,Lignite,NaN,10 600,16.0,Medium
29,RO42,RO42,2,RO,Vest,Vest,RO42,RO42,788.0,POINT (21.98891 45.71870),0,RO42,Vest,Hard coal,NaN,4 442,20.0,High
30,PL21,PL21,2,PL,Malopolskie,Malopolskie,PL21,PL21,1214.0,POINT (20.26892 49.85894),11,PL21,Małopolskie,Hard coal,NaN,4 644,16.0,Medium
31,PL22,PL22,2,PL,Slaskie,Slaskie,PL22,PL22,1746.0,POINT (18.99389 50.33107),6,PL22,Śląskie,Hard coal,NaN,79 548,17.0,High

In [37]:
df_job_all.to_file('jobs_all.geojson', driver='GeoJSON')

In [39]:
df1 = pd.read_excel('death_rate_t.xlsx')
gdf1 = gpd.read_file('NUTS_RG_10M_2021_4326_LEVL_3.geojson')

In [40]:
df1.head()

      NUTS  VALUE
0    Vidin    319
1  Montana    403
2   Vratsa    523
3   Pleven    869
4   Lovech    451

In [44]:
df_death = gdf1.merge(df1, left_on='NAME_LATN', right_on='NUTS')
df_death

,id,NUTS_ID,LEVL_CODE,CNTR_CODE,NAME_LATN,NUTS_NAME,MOUNT_TYPE,URBN_TYPE,COAST_TYPE,FID,geometry,NUTS,VALUE
0,BG423,BG423,3,BG,Pazardzhik,Пазарджик,3.0,2.0,3,BG423,"POLYGON ((24.42101 42.55306, 24.41032 42.46950...",Pazardzhik,810
1,BG424,BG424,3,BG,Smolyan,Смолян,3.0,3.0,3,BG424,"POLYGON ((25.07422 41.79348, 25.05851 41.75177...",Smolyan,445
2,BG425,BG425,3,BG,Kardzhali,Кърджали,3.0,3.0,3,BG425,"POLYGON ((25.94863 41.32034, 25.90644 41.30757...",Kardzhali,422
3,CH025,CH025,3,CH,Jura,Jura,3.0,3.0,3,CH025,"POLYGON ((7.13035 47.50304, 7.19070 47.44275, ...",Jura,701
4,FRC22,FRC22,3,FR,Jura,Jura,3.0,3.0,3,FRC22,"POLYGON ((5.69873 47.26500, 5.81500 47.15148, ...",Jura,701
...,...,...,...,...,...,...,...,...,...,...,...,...,...
507,PT11E,PT11E,3,PT,Terras de Trás-os-Montes,Terras de Trás-os-Montes,3.0,3.0,3,PT11E,"POLYGON ((-6.47971 41.29438, -6.68979 41.20524...",Terras de Trás-os-Montes,1077
508,PT150,PT150,3,PT,Algarve,Algarve,4.0,2.0,1,PT150,"POLYGON ((-7.40192 37.17483, -7.55978 37.14977...",Algarve,6906
509,PT16B,PT16B,3,PT,Oeste,Oeste,4.0,3.0,1,PT16B,"POLYGON ((-8.90342 39.46601, -8.99470 39.34672...",Oeste,4347
510,PT16D,PT16D,3,PT,Região de Aveiro,Região de Aveiro,4.0,2.0,1,PT16D,"POLYGON ((-8.27337 40.76317, -8.32343 40.72698...",Região de Aveiro,4579
511,PT16E,PT16E,3,PT,Região de Coimbra,Região de Coimbra,4.0,3.0,1,PT16E,"POLYGON ((-8.25066 40.51489, -8.16996 40.45981...",Região de Coimbra,5994

In [45]:
df_death.to_file('ent_mort.geojson', driver='GeoJSON')

In [50]:
df_pat = pd.read_excel('patent_data.xlsx')
df_pat.dropna()

0.50    59
1.00    55
0.33    42
0.25    39
0.83    13
        ..
5.35     1
5.48     1
9.91     1
2.80     1
5.96     1
Name: VALUE, Length: 475, dtype: int64

In [52]:
gdf2010 = gpd.read_file('NUTS_RG_10M_2021_4326_LEVL_3.geojson')
gdf2010.head()

,id,NUTS_ID,LEVL_CODE,CNTR_CODE,NAME_LATN,NUTS_NAME,MOUNT_TYPE,URBN_TYPE,COAST_TYPE,FID,geometry
0,BG423,BG423,3,BG,Pazardzhik,Пазарджик,3.0,2.0,3,BG423,"POLYGON ((24.42101 42.55306, 24.41032 42.46950..."
1,BG424,BG424,3,BG,Smolyan,Смолян,3.0,3.0,3,BG424,"POLYGON ((25.07422 41.79348, 25.05851 41.75177..."
2,BG425,BG425,3,BG,Kardzhali,Кърджали,3.0,3.0,3,BG425,"POLYGON ((25.94863 41.32034, 25.90644 41.30757..."
3,CH011,CH011,3,CH,Vaud,Vaud,3.0,2.0,3,CH011,"MULTIPOLYGON (((6.86623 46.90929, 6.89621 46.9..."
4,CH012,CH012,3,CH,Valais,Valais,3.0,2.0,3,CH012,"POLYGON ((8.47767 46.52760, 8.39953 46.48872, ..."

In [54]:
df_patent = gdf2010.merge(df_pat, left_on='NUTS_ID', right_on='NUTSCODE')
df_patent.head()

,id,NUTS_ID,LEVL_CODE,CNTR_CODE,NAME_LATN,NUTS_NAME,MOUNT_TYPE,URBN_TYPE,COAST_TYPE,FID,geometry,NUTSCODE,VALUE
0,BG423,BG423,3,BG,Pazardzhik,Пазарджик,3.0,2.0,3,BG423,"POLYGON ((24.42101 42.55306, 24.41032 42.46950...",BG423,NaN
1,CH011,CH011,3,CH,Vaud,Vaud,3.0,2.0,3,CH011,"MULTIPOLYGON (((6.86623 46.90929, 6.89621 46.9...",CH011,51.05
2,CH012,CH012,3,CH,Valais,Valais,3.0,2.0,3,CH012,"POLYGON ((8.47767 46.52760, 8.39953 46.48872, ...",CH012,1.55
3,CH013,CH013,3,CH,Genève,Genève,1.0,1.0,3,CH013,"POLYGON ((6.21955 46.31188, 6.29119 46.25099, ...",CH013,8.15
4,CH021,CH021,3,CH,Bern,Bern,3.0,2.0,3,CH021,"MULTIPOLYGON (((7.55840 47.32237, 7.36700 47.2...",CH021,18.60

In [59]:
df_patent.dropna(inplace=True)

In [60]:
df_patent.to_file('patent.geojson', driver='GeoJSON')

In [58]:
df_pat['VALUE'].describe()

count    960.000000
mean       8.896833
std       25.631087
min        0.050000
25%        0.830000
50%        2.275000
75%        6.710000
max      301.670000
Name: VALUE, dtype: float64

In [100]:
strconv = gpd.read_file('jobs_all.geojson')
strconv['labour']= pd.to_numeric(strconv['Unnamed: 4'], errors='ignore')
strconv['labour'] = strconv['labour'].str.replace(" ",'')
strconv['labour'] = pd.to_numeric(strconv['labour'])
strconv['labour'].astype(float)
strconv.drop(['Unnamed: 0', 'NUTS-2', 'tunit_code', 'NUTS-2 name'], axis=1, inplace=True)
strconv['meteres'] = strconv['geometry'].buffer(0.3)
extrude = strconv.drop(['geometry'], axis=1)
extrude.rename(columns={'meteres':'geometry'}, inplace=True)
extrude

<ipython-input-100-4e6e90581dc6>:7: UserWarning: Geometry is in a geographic CRS. Results from 'buffer' are likely incorrect. Use 'GeoSeries.to_crs()' to re-project geometries to a projected CRS before this operation.

  strconv['meteres'] = strconv['geometry'].buffer(0.1)

,id,NUTS_ID,LEVL_CODE,CNTR_CODE,NAME_LATN,NUTS_NAME,FID,TOTAL,Type of coal,Jobs,Unnamed: 4,Risk rate,Risk zone,labour,geometry
0,ITG2,ITG2,2,IT,Sardegna,Sardegna,ITG2,165.0,Hard coal,None,348,17.0,High,348,"POLYGON ((9.13019 40.08696, 9.12970 40.07716, ..."
1,HU31,HU31,2,HU,Észak-Magyarország,Észak-Magyarország,HU31,632.0,Lignite,None,1 655,12.0,Low,1655,"POLYGON ((20.58766 48.04732, 20.58718 48.03752..."
2,ES24,ES24,2,ES,Aragón,Aragón,ES24,350.0,Hard coal,None,1 422,14.0,Medium,1422,"POLYGON ((-0.55984 41.51941, -0.56032 41.50960..."
3,ES41,ES41,2,ES,Castilla y León,Castilla y León,ES41,861.0,Hard coal,None,394,16.5,Medium,394,"POLYGON ((-4.68205 41.75422, -4.68253 41.74442..."
4,ES42,ES42,2,ES,Castilla-La Mancha,Castilla-La Mancha,ES42,0.0,Hard coal,None,219,16.0,Medium,219,"POLYGON ((-2.90459 39.58096, -2.90507 39.57116..."
5,EL65,EL65,2,EL,Peloponnisos,Πελοπόννησος,EL65,210.0,Lignite,None,636,13.0,Low,636,"POLYGON ((22.55833 37.34267, 22.55785 37.33287..."
6,EL53,EL53,2,EL,Dytiki Makedonia,Δυτική Μακεδονία,EL53,1008.0,Lignite,None,4 283,13.0,Low,4283,"POLYGON ((21.58411 40.36184, 21.58363 40.35204..."
7,ES12,ES12,2,ES,Principado de Asturias,Principado de Asturias,ES12,589.0,Hard coal,None,1 313,18.5,High,1313,"POLYGON ((-5.89285 43.29214, -5.89333 43.28234..."
8,BG34,BG34,2,BG,Yugoiztochen,Югоизточен,BG34,0.0,Lignite,None,10 773,14.0,Medium,10773,"POLYGON ((26.64087 42.47193, 26.64039 42.46213..."
9,BG41,BG41,2,BG,Yugozapaden,Югозападен,BG41,0.0,Brown coal,None,991,16.0,Medium,991,"POLYGON ((23.44295 42.31795, 23.44247 42.30815..."
10,DEA1,DEA1,2,DE,Düsseldorf,Düsseldorf,DEA1,1856.0,Lignite,None,2 578,11.0,Low,2578,"POLYGON ((6.69619 51.43016, 6.69571 51.42035, ..."
11,DEA2,DEA2,2,DE,Köln,Köln,DEA2,3070.0,Lignite,None,4 420,13.0,Low,4420,"POLYGON ((6.90943 50.82505, 6.90895 50.81525, ..."
12,DEA3,DEA3,2,DE,Münster,Münster,DEA3,370.0,Hard coal,None,9 640,18.0,High,9640,"POLYGON ((7.51647 51.95066, 7.51599 51.94086, ..."
13,CZ04,CZ04,2,CZ,Severozápad,Severozápad,CZ04,192.0,Lignite,None,7 869,15.5,Medium,7869,"POLYGON ((13.52929 50.39452, 13.52881 50.38472..."
14,DED2,DED2,2,DE,Dresden,Dresden,DED2,0.0,Lignite,None,2 783,14.0,Medium,2783,"POLYGON ((14.24001 51.17059, 14.23953 51.16079..."
15,CZ08,CZ08,2,CZ,Moravskoslezsko,Moravskoslezsko,CZ08,0.0,Hard coal,None,10 131,18.0,High,10131,"POLYGON ((18.07938 49.82047, 18.07889 49.81067..."
16,DE40,DE40,2,DE,Brandenburg,Brandenburg,DE40,3000.0,Lignite,None,3 402,15.0,Medium,3402,"POLYGON ((13.49767 52.47265, 13.49719 52.46285..."
17,DED5,DED5,2,DE,Leipzig,Leipzig,DED5,0.0,Lignite,None,1 004,14.0,Medium,1004,"POLYGON ((12.77442 51.35890, 12.77394 51.34910..."
18,DEE0,DEE0,2,DE,Sachsen-Anhalt,Sachsen-Anhalt,DEE0,960.0,Lignite,None,904,14.0,Medium,904,"POLYGON ((11.80056 52.01362, 11.80008 52.00382..."
19,SI03,SI03,2,SI,Vzhodna Slovenija,Vzhodna Slovenija,SI03,820.0,Lignite,None,1 274,17.0,High,1274,"POLYGON ((15.36028 46.15226, 15.35980 46.14246..."
20,SK02,SK02,2,SK,Západné Slovensko,Západné Slovensko,SK02,133.0,Lignite,None,2 190,20.0,High,2190,"POLYGON ((18.16682 48.41736, 18.16634 48.40756..."
21,UKC2,UKC2,2,UK,Northumberland and Tyne and Wear,Northumberland and Tyne and Wear,UKC2,420.0,Hard coal,None,723,12.5,Low,723,"POLYGON ((-1.91899 55.21171, -1.91947 55.20191..."
22,UKE2,UKE2,2,UK,North Yorkshire,North Yorkshire,UKE2,1500.0,Hard coal,None,333,16.0,Medium,333,"POLYGON ((-1.30790 54.18276, -1.30838 54.17295..."
23,UKF1,UKF1,2,UK,Derbyshire and Nottinghamshire,Derbyshire and Nottinghamshire,UKF1,4943.0,Hard coal,None,80,16.0,Medium,80,"POLYGON ((-1.24080 53.13194, -1.24128 53.12214..."
24,UKL2,UKL2,2,UK,East Wales,East Wales,UKL2,500.0,Hard coal,None,184,12.0,Low,184,"POLYGON ((-3.19446 52.29015, -3.19494 52.28034..."
25,PL41,PL41,2,PL,Wielkopolskie,Wielkopolskie,PL41,1461.0,Lignite,None,2 079,14.0,Medium,2079,"POLYGON ((17.34260 52.33068, 17.34212 52.32088..."
26,PL51,PL51,2,PL,Dolnoslaskie,Dolnoslaskie,PL51,1399.0,Lignite,None,1 108,12.0,Low,1108,"POLYGON ((16.51050 51.08957, 16.51002 51.07977..."
27,PL11,PL11,2,PL,Lódzkie,Lódzkie,PL11,198.0,Lignite,None,6 388,13.5,Low,6388,"POLYGON ((19.51754 51.60481, 19.51706 51.59501..."
28,RO41,RO41,2,RO,Sud-Vest Oltenia,Sud-Vest Oltenia,RO41,450.0,Lignite,None,10 600,16.0,Medium,10600,"POLYGON ((23.76963 44.59695, 23.76915 44.58715..."
29,RO42,RO42,2,RO,Vest,Vest,RO42,788.0,Hard coal,None,4 442,20.0,High,4442,"POLYGON ((22.08891 45.71870, 22.08843 45.70889..."
30,PL21,PL21,2,PL,Malopolskie,Malopolskie,PL21,1214.0,Hard coal,None,4 644,16.0,Medium,4644,"POLYGON ((20.36892 49.85894, 20.36844 49.84914..."
31,PL22,PL22,2,PL,Slaskie,Slaskie,PL22,1746.0,Hard coal,None,79 548,17.0,High,79548,"POLYGON ((19.09389 50.33107, 19.09341 50.32127..."

In [101]:
extrude.to_file('extrude.geojson', driver='GeoJSON')

In [103]:
extrude['labour'].describe()

count       32.000000
mean      5573.687500
std      13898.586669
min         80.000000
25%        858.750000
50%       1867.000000
75%       4492.500000
max      79548.000000
Name: labour, dtype: float64

In [120]:
test_2 = gpd.read_file('Powerplants.geojson')
test_2['that'] = test_2['geometry'].buffer(0.09)
test_2 = test_2.drop(['geometry'], axis=1)
test_2.rename(columns={'that':'geometry'}, inplace=True)
test_2.to_file('testd.geojson', driver="GeoJSON")

<ipython-input-120-776daafe64ba>:2: UserWarning: Geometry is in a geographic CRS. Results from 'buffer' are likely incorrect. Use 'GeoSeries.to_crs()' to re-project geometries to a projected CRS before this operation.

  test_2['that'] = test_2['geometry'].buffer(0.09)

In [199]:
jobs = pd.read_csv('tot_job.csv')
jobs.head()

,Unnamed: 0,NUTS-2,NUTS-2 name,Type of coal,Jobs,Unnamed: 4,Risk rate,Risk zone
0,0,RO42,Vest,Hard coal,NaN,4 442,20.0,High
1,1,SK02,Západné Slovensko,Lignite,NaN,2 190,20.0,High
2,2,ES12,Principado de Asturias,Hard coal,NaN,1 313,18.5,High
3,3,CZ08,Moravskoslezsko,Hard coal,NaN,10 131,18.0,High
4,4,DEA3,Münster,Hard coal,NaN,9 640,18.0,High

In [204]:
# jobs.drop(['Unnamed: 0', 'NUTS-2', 'Jobs', 'Risk zone'], axis=1, inplace=True)
# jobs.head()
jobs.columns = ['region', 'coal_type', 'jobs', 'risk']
jobs.head()

                   region  coal_type    jobs  risk
0                    Vest  Hard coal   4 442  20.0
1       Západné Slovensko    Lignite   2 190  20.0
2  Principado de Asturias  Hard coal   1 313  18.5
3         Moravskoslezsko  Hard coal  10 131  18.0
4                 Münster  Hard coal   9 640  18.0

In [205]:
jobs['jobs'] = jobs['jobs'].str.replace(" ", '')
jobs['jobs'] = jobs['jobs'].astype(float)
jobs.head()

                   region  coal_type     jobs  risk
0                    Vest  Hard coal   4442.0  20.0
1       Západné Slovensko    Lignite   2190.0  20.0
2  Principado de Asturias  Hard coal   1313.0  18.5
3         Moravskoslezsko  Hard coal  10131.0  18.0
4                 Münster  Hard coal   9640.0  18.0

In [207]:
jobs['coal_type']= jobs['coal_type'].str.replace("Brown coal", 'coal')
jobs['coal_type']= jobs['coal_type'].str.replace('Hard coal', 'coal')
jobs.head()

                   region coal_type     jobs  risk
0                    Vest      coal   4442.0  20.0
1       Západné Slovensko   Lignite   2190.0  20.0
2  Principado de Asturias      coal   1313.0  18.5
3         Moravskoslezsko      coal  10131.0  18.0
4                 Münster      coal   9640.0  18.0

In [209]:
jobs.to_csv(r'apache_jobs.csv', index=False)

In [214]:
pops = jobs.transpose()
pops.head()

,0,1,2,3,4,5,6,7,8,9,...,29,30,31,32,33,34,35,36,37,38
region,Vest,Západné Slovensko,Principado de Asturias,Moravskoslezsko,Münster,Sardegna,Śląskie,Vzhodna Slovenija,South Yorkshire,Castilla y León,...,Peloponnisos,West Wales and The,Valleys,Northumberland and,Tyne and Wear,Észak-Magyarország,Dolnośląskie,South Western Scotland,East Wales,Düsseldorf
coal_type,coal,Lignite,coal,coal,coal,coal,coal,Lignite,coal,coal,...,Lignite,coal,NaN,coal,NaN,Lignite,Lignite,coal,coal,Lignite
jobs,4442.0,2190.0,1313.0,10131.0,9640.0,348.0,79548.0,1274.0,34.0,394.0,...,636.0,367.0,NaN,723.0,NaN,1655.0,1108.0,241.0,184.0,2578.0
risk,20.0,20.0,18.5,18.0,18.0,17.0,17.0,17.0,17.0,16.5,...,13.0,13.0,NaN,12.5,NaN,12.0,12.0,12.0,12.0,11.0

In [212]:
bf = jobs.groupby('coal_type', as_index=False).agg({'jobs':'sum', 'risk':'mean','region':'unique'})

bf.head()

,coal_type,jobs,risk,region
0,Lignite,63946.0,14.176471,"[Západné Slovensko, Vzhodna Slovenija, Sud-Ves..."
1,coal,120823.0,15.815789,"[Vest, Principado de Asturias, Moravskoslezsko..."

In [213]:
bf.to_csv('apache_test.csv')

In [217]:
bf['region']

0    [Západné Slovensko, Vzhodna Slovenija, Sud-Ves...
1    [Vest, Principado de Asturias, Moravskoslezsko...
Name: region, dtype: object

In [218]:
test_4 = gpd.read_file('NUTS_RG_03M_2010_4326_LEVL_3.geojson')
test_3 = gpd.read_file('NUTS_RG_03M_2013_4326_LEVL_3.geojson')

In [222]:
test_4.shape

(1453, 8)

In [221]:
nuts_all = pd.concat([test_3, test_4]).drop_duplicates('NUTS_ID').reset_index(drop=True)
nuts_all

,id,NUTS_ID,LEVL_CODE,CNTR_CODE,NAME_LATN,NUTS_NAME,FID,geometry
0,DEF0D,DEF0D,3,DE,Segeberg,Segeberg,DEF0D,"POLYGON ((10.41747 54.08324, 10.44423 54.07153..."
1,DEF0E,DEF0E,3,DE,Steinburg,Steinburg,DEF0E,"POLYGON ((9.86433 54.01203, 9.83457 53.99657, ..."
2,DEF0F,DEF0F,3,DE,Stormarn,Stormarn,DEF0F,"POLYGON ((10.57958 53.89763, 10.56405 53.88588..."
3,DEG01,DEG01,3,DE,"Erfurt, Kreisfreie Stadt","Erfurt, Kreisfreie Stadt",DEG01,"POLYGON ((11.17066 51.01873, 11.16648 51.00277..."
4,BE332,BE332,3,BE,Arr. Liège,Arr. Liège,BE332,"POLYGON ((5.68200 50.75745, 5.72184 50.74559, ..."
...,...,...,...,...,...,...,...,...
1597,UKI23,UKI23,3,UK,Outer London - West and North West,Outer London - West and North West,UKI23,"POLYGON ((-0.13872 51.61019, -0.14263 51.60565..."
1598,UKJ23,UKJ23,3,UK,Surrey,Surrey,UKJ23,"POLYGON ((-0.31766 51.39366, -0.31920 51.37737..."
1599,UKJ24,UKJ24,3,UK,West Sussex,West Sussex,UKJ24,"POLYGON ((0.02740 51.13984, 0.04460 51.11064, ..."
1600,UKJ33,UKJ33,3,UK,Hampshire CC,Hampshire CC,UKJ33,"MULTIPOLYGON (((-0.77543 51.33196, -0.77409 51..."
1601,UKJ42,UKJ42,3,UK,Kent CC,Kent CC,UKJ42,"POLYGON ((0.45890 51.45494, 0.49102 51.43867, ..."

In [223]:
patent_data = pd.read_excel('patent_data.xlsx')
patent_data.head()

  NUTSCODE  VALUE
0    BE100  26.06
1    BE211  76.76
2    BE212   6.87
3    BE213  12.46
4    BE221   2.72

In [230]:
patent_data.shape

(960, 2)

In [228]:
patent_data.dropna(inplace=True)
patent_data.reset_index(drop=True, inplace=True)

In [229]:
df_patent = nuts_all.merge(patent_data, left_on='NUTS_ID', right_on='NUTSCODE')
df_patent.shape
df_patent.to_file('patent_geometries.geojson', driver='GeoJSON')

In [231]:
df_patent.shape

(932, 10)

In [413]:
deaths = pd.read_excel('death_rate_t.xlsx')
# deaths['VALUE'] = deaths['VALUE'].fillna(deaths['VALUE'].mean())
# deaths.isna().value_counts()

In [236]:
test_4.shape

(1453, 8)

In [414]:
deaths.rename(columns={'NUTS': 'NUTS_ID'}, inplace=True)
deaths

    NUTS_ID  VALUE
0     BG311  319.0
1     BG312  403.0
2     BG313  523.0
3     BG314  869.0
4     BG315  451.0
..      ...    ...
847   SE313    NaN
848   SE321    NaN
849   SE322    NaN
850   SE331    NaN
851   SE332    NaN

[852 rows x 2 columns]

In [459]:
dfdef = pd.merge(test_4, deaths, how='left', on='NUTS_ID')
dfdef.shape
dfdef['VALUE'].isna().value_counts()

True     898
False    555
Name: VALUE, dtype: int64

In [247]:
# dfdef['VALUE'] = dfdef['VALUE'].fillna(dfdef['VALUE'].mean())

In [443]:
def randomiseMissingData(m):
    "randomise missing data for DataFrame (within a column)"
    for col in m.columns:
        data = m[col]
        mask = data.isnull()
        samples = random.choices(data[~mask].values, k = mask.sum())
        mask = [i for i in data[~mask].values if i >=10000]


randomiseMissingData(dfdef)

In [468]:
def msdata(m):
    sp = np.arange(5000, 10000, 3).tolist()
    for col in m.columns:
        data = m[col]
        mask = data.isnull()
        samples = random.choices(sp, k = mask.sum())
        mask = samples
msdata(dfdef)

In [469]:
dfdef['VALUE'].isna().value_counts()

False    1453
Name: VALUE, dtype: int64

In [472]:
dfdef.shape

(1453, 9)

In [481]:
searchfor = ['EL', 'TR', 'SE', 'CH', 'MK']

bif = dfdef[~dfdef.NUTS_ID.str.contains('|'.join(searchfor))]
bif.shape

(1266, 9)

In [480]:
bif.to_file('def.geojson', driver='GeoJSON')